{
  "backend/main.mo": "Motoko backend defining bet, booking, and result types, storing lists of bets/bookings, predefined histories, and providing submit and query functions.",
  "feature_evidence.json": "Feature evidence report mapping required UI features to corresponding frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all major frontend components and pages.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables, dark mode theme, and base styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, theme provider, layout, and page components.",
  "frontend/src/components/home/InfoBanner.tsx": "Animated banner showing three info lines that fade in sequentially over a background image.",
  "frontend/src/components/home/LiveResultCard.tsx": "Reusable live result card with blinking indicator, number circles, and a Play Now button.",
  "frontend/src/components/home/VipWinnersTicker.tsx": "Auto-scrolling vertical ticker displaying duplicated VIP winners list with flag and masked info.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout wrapping all pages with spacing and fixed bottom navigation.",
  "frontend/src/components/layout/BottomNav.tsx": "Fixed bottom nav bar with Home, Deposit, and Withdraw buttons and active path highlighting.",
  "frontend/src/components/results/ResultRow.tsx": "Single result row showing date, game name, time, and winning number with gold-accent styling.",
  "frontend/src/constants/homeContent.ts": "Static game rate data and a generated list of 25 VIP winners with masked names and phones.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, including identity loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode tokens, and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/DepositPage.tsx": "Implements a deposit form with preset amounts, validation, and simulated processing feedback.",
  "frontend/src/pages/GamePlayPage.tsx": "Allows users to place bets by entering numbers and amounts, then submits them to the backend actor.",
  "frontend/src/pages/HomePage.tsx": "Displays the main home screen with hero banner, quick results, game rates, and navigation to play pages.",
  "frontend/src/pages/ResultsPage.tsx": "Fetches and displays lottery result history based on selected type using backend actor methods.",
  "frontend/src/pages/TicketBookingPage.tsx": "Ticket booking form that submits user info and selected ticket type to an actor, with validation, toasts, and navigation after success.",
  "frontend/src/pages/WithdrawPage.tsx": "Withdrawal form with preset amounts, balance validation, simulated processing, and success navigation feedback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project state, requirements, architecture notes, known issues, and required app features for a lottery platform."
}